# GetUnitTypeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableColumn..::..GetUnitTypeId Method
FamilySizeTableColumn Class See Also
---
Gets the identifier of the unit quantifying values in the column.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ForgeTypeId GetUnitTypeId()
```

Visual Basic
---
```text
Public Function GetUnitTypeId As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetUnitTypeId()
```

# ### Return Value
Identifier of the unit.
# See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace